evidence/07-incidents/2201/k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * shift_change_search: 200 looping VUs for 30s (gracefulStop: 30s)


running (0m00.9s), 200/200 VUs, 176 complete and 0 interrupted iterations
shift_change_search   [   3% ] 200 VUs  00.9s/30s

running (0m01.9s), 200/200 VUs, 611 complete and 0 interrupted iterations
shift_change_search   [   6% ] 200 VUs  01.9s/30s

running (0m02.9s), 200/200 VUs, 1299 complete and 0 interrupted iterations
shift_change_search   [  10% ] 200 VUs  02.9s/30s

running (0m03.9s), 200/200 VUs, 1853 complete and 0 interrupted iterations
shift_change_search   [  13% ] 200 VUs  03.9s/30s

running (0m04.9s), 200/200 VUs, 2509 complete and 0 interrupted iterations
shift_change_search   [  16% ] 200 VUs  04.9s/30s

running (0m05.9s), 200/200 VUs, 3092 complete and 0 interrupted iterations
shift_change_search   [  20% ] 200 VUs  05.9s/30s

running (0m06.9s), 200/200 VUs, 3672 complete and 0 interrupted iterations
shift_change_search   [  23% ] 200 VUs  06.9s/30s

running (0m07.9s), 200/200 VUs, 4368 complete and 0 interrupted iterations
shift_change_search   [  26% ] 200 VUs  07.9s/30s

running (0m08.9s), 200/200 VUs, 5036 complete and 0 interrupted iterations
shift_change_search   [  30% ] 200 VUs  08.9s/30s

running (0m09.9s), 200/200 VUs, 5668 complete and 0 interrupted iterations
shift_change_search   [  33% ] 200 VUs  09.9s/30s

running (0m10.9s), 200/200 VUs, 6279 complete and 0 interrupted iterations
shift_change_search   [  36% ] 200 VUs  10.9s/30s

running (0m11.9s), 200/200 VUs, 6898 complete and 0 interrupted iterations
shift_change_search   [  40% ] 200 VUs  11.9s/30s

running (0m12.9s), 200/200 VUs, 7598 complete and 0 interrupted iterations
shift_change_search   [  43% ] 200 VUs  12.9s/30s

running (0m13.9s), 200/200 VUs, 8217 complete and 0 interrupted iterations
shift_change_search   [  46% ] 200 VUs  13.9s/30s

running (0m14.9s), 200/200 VUs, 8903 complete and 0 interrupted iterations
shift_change_search   [  50% ] 200 VUs  14.9s/30s

running (0m15.9s), 200/200 VUs, 9596 complete and 0 interrupted iterations
shift_change_search   [  53% ] 200 VUs  15.9s/30s

running (0m16.9s), 200/200 VUs, 10187 complete and 0 interrupted iterations
shift_change_search   [  56% ] 200 VUs  16.9s/30s

running (0m17.9s), 200/200 VUs, 10560 complete and 0 interrupted iterations
shift_change_search   [  60% ] 200 VUs  17.9s/30s

running (0m18.9s), 200/200 VUs, 11223 complete and 0 interrupted iterations
shift_change_search   [  63% ] 200 VUs  18.9s/30s

running (0m19.9s), 200/200 VUs, 11942 complete and 0 interrupted iterations
shift_change_search   [  66% ] 200 VUs  19.9s/30s

running (0m20.9s), 200/200 VUs, 12561 complete and 0 interrupted iterations
shift_change_search   [  70% ] 200 VUs  20.9s/30s

running (0m21.9s), 200/200 VUs, 13246 complete and 0 interrupted iterations
shift_change_search   [  73% ] 200 VUs  21.9s/30s

running (0m22.9s), 200/200 VUs, 14014 complete and 0 interrupted iterations
shift_change_search   [  76% ] 200 VUs  22.9s/30s

running (0m23.9s), 200/200 VUs, 14625 complete and 0 interrupted iterations
shift_change_search   [  80% ] 200 VUs  23.9s/30s

running (0m24.9s), 200/200 VUs, 15352 complete and 0 interrupted iterations
shift_change_search   [  83% ] 200 VUs  24.9s/30s

running (0m25.9s), 200/200 VUs, 16113 complete and 0 interrupted iterations
shift_change_search   [  86% ] 200 VUs  25.9s/30s

running (0m26.9s), 200/200 VUs, 16797 complete and 0 interrupted iterations
shift_change_search   [  90% ] 200 VUs  26.9s/30s

running (0m27.9s), 200/200 VUs, 17576 complete and 0 interrupted iterations
shift_change_search   [  93% ] 200 VUs  27.9s/30s

running (0m28.9s), 200/200 VUs, 18228 complete and 0 interrupted iterations
shift_change_search   [  96% ] 200 VUs  28.9s/30s

running (0m29.9s), 200/200 VUs, 18949 complete and 0 interrupted iterations
shift_change_search   [ 100% ] 200 VUs  29.9s/30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<300' p(95)=427.39ms


  █ TOTAL RESULTS 

    checks_total.......: 19199   635.476618/s
    checks_succeeded...: 100.00% 19199 out of 19199
    checks_failed......: 0.00%   0 out of 19199

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=312.33ms min=189.6ms  med=296.54ms max=2.43s p(90)=386.08ms p(95)=427.39ms
      { expected_response:true }...: avg=312.33ms min=189.6ms  med=296.54ms max=2.43s p(90)=386.08ms p(95)=427.39ms
    http_req_failed................: 0.00%  0 out of 19199
    http_reqs......................: 19199  635.476618/s

    EXECUTION
    iteration_duration.............: avg=313.07ms min=189.91ms med=296.76ms max=2.49s p(90)=386.52ms p(95)=429.21ms
    iterations.....................: 19199  635.476618/s
    vus............................: 200    min=200        max=200
    vus_max........................: 200    min=200        max=200

    NETWORK
    data_received..................: 151 MB 5.0 MB/s
    data_sent......................: 2.0 MB 66 kB/s



running (0m30.2s), 000/200 VUs, 19199 complete and 0 interrupted iterations
shift_change_search ✓ [ 100% ] 200 VUs  30s